#include <iostream>
#include "cSort.h"
using namespace std;

int main(int argc, char** argv) {
	int arr1[30]{ 19, 14, 22, 22, 17, 22, 13, 21, 20, 24, 18, 10, 17, 16, 17, 20, 22, 11, 20, 16, 14, 13, 10, 22, 18, 14, 16, 24, 19, 17 };
	cout << "Исходный массив: ";
	for (int i = 0; i < 30; i++) {
		cout << arr1[i] << ' ';
	}

	count_sort(arr1, 30);
	cout << "\nОтсортированный массив: ";
	for (int i = 0; i < 30; i++) {
		cout << arr1[i] << ' ';
	}
	cout << endl;

	int arr2[40]{ 16, 17, 14, 20, 22, 20, 17, 22, 16, 19, 23, 24, 20, 22, 21, 18, 14, 16, 17, 21, 10, 11, 19, 23, 11, 11, 17, 17, 11, 21, 17, 11, 17, 16, 12, 11, 16, 22, 23, 16 };

	cout << "\nИсходный массив: ";
	for (int i = 0; i < 40; i++) {
		cout << arr2[i] << ' ';
	}

	count_sort(arr2, 40);
	cout << "\nОтсортированный массив: ";
	for (int i = 0; i < 40; i++) {
		cout << arr2[i] << ' ';
	}
	cout << endl;

	int arr3[45]{ 21, 15, 19, 18, 23, 12, 18, 18, 19, 23, 12, 20, 15, 22, 21, 18, 19, 20, 12, 16, 20, 14, 17, 13, 10, 23, 19, 14, 10, 22, 19, 12, 24, 23, 22, 15, 13, 22, 18, 18, 11, 23, 24, 17, 10 };

	cout << "\nИсходный массив: ";
	for (int i = 0; i < 45; i++) {
		cout << arr3[i] << ' ';
	}

	count_sort(arr3, 45);
	cout << "\nОтсортированный массив: ";
	for (int i = 0; i < 45; i++) {
		cout << arr3[i] << ' ';
	}
	cout << endl;
	
	return 0;
}